<h2 align="center"> Итоговая контрольная работа </h2>

**Задача:**

1. Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. 

2. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 

3. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

<h2 align="center">Описание решения:</h2>

1. Для начала необходимо создать строковый массив, в который мы будем записывать данные, вводимые пользователем. Ввод данных пользователем заканчивается, как только он нажимает Enter:

```c#
Console.WriteLine("Введите элементы массива через пробел или запятую: ");
string x = Console.ReadLine();
string[] result = x.Split(';',' ',',','.').ToArray();
```

2. 